Autodesk.Revit.UI.LicensingUtils.GetProductId(System.String,System.String,System.String)
Registers a product with the licensing component and returns an id of the product to be used when checking for a valid license.
productName:
Product name.
productKey:
Product id.
featureId:
Feature id.
Returns:
Id of the product.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021